{
	"FEATUREDITEMS": [],
	"CONTENTS": [
		{
			"_title": {
				"VALUE": "Part-time Librarian"
			},
			"About": {
				"VALUE": "<seml></seml>"
			},
			"_endDate": {
				"VALUE": "March, 25 2018 01:02:00"
			},
			"Description": {
				"VALUE": "<seml><p>At BCPL, staff members have the opportunity to enrich individual lives and build strong communities by delivering exceptional customer experiences, establishing meaningful partnerships, and creating innovative learning spaces. We seek enthusiastic, openminded, self-motivated individuals who can work well independently and with others. BCPL circulates over 11 million items and provides library services through its 19 branches, 4 mobile library vehicles, and an extensive outreach network. If you are forward thinking and passionate about public service, consider joining BCPL as a <strong>Part-time Librarian</strong>.</p>\r\n\r\n<p><strong>Key Responsibilities</strong></p>\r\n\r\n<p> Assist customers in finding answers to a broad range of questions through use of print and electronic resources  Guide customers in selecting appropriate materials for reading/viewing/listening either for personal pleasure or professional development  Commitment to customer service and the ability to work with people of diverse backgrounds  May develop and maintain a portion of the Library’s collection  May plan and present Library-related programs and outreach services  Understand and apply technological skills and use online tools to improve efficiency and assist customers  May serve on teams and committees within the branch and system-wide  Maintain professional growth and development through a variety of continuing educational resources.</p>\r\n\r\n<p>Education/Experience Requirements  MLS from an accredited ALA school or completion of Library Associate Training Institute, or a bachelor’s degree and six months of related experience  Knowledge of Library organization and operation  Knowledge of print, electronic and online information resources  Ability to establish and maintain relationships with customers, community groups and co-workers  Ability to plan, organize and present a variety of activities and presentations  Ability to demonstrate written and verbal communication skills  Ability to work on a public service desk for long perio</p>\r\n</seml>"
			},
			"UUID": "bde169fb-40ae-4a20-b600028f7c7f120c",
			"_startDate": {
				"VALUE": "January, 25 2018 01:01:00"
			},
			"_urlTitle": {
				"VALUE": "part-time-librarian"
			},
			"Employment_Type": {
				"VALUE": "Part-Time",
				"LABEL": "Part-Time"
			},
			"Key_Responsibilities": {
				"VALUE": "<seml></seml>"
			},
			"Location": {
				"VALUE": "Owings Mills Branch"
			},
			"Salary": {
				"VALUE": "Hourly salary: $18.59-$24.41/hour, commensurate with experience."
			},
			"To_Apply": {
				"VALUE": "<seml></seml>"
			},
			"Vacancy_ID": {
				"VALUE": ""
			},
			"ACTIVE": true,
			"_printDate": {
				"VALUE": "January, 26 2018 00:00:00"
			},
			"Requirements": {
				"VALUE": "<seml></seml>"
			},
			"Internal_Only": {
				"VALUE": false
			}
		},
		{
			"_title": {
				"VALUE": "Circulation Assistant II"
			},
			"About": {
				"VALUE": "<seml>At BCPL, staff members have the opportunity to enrich individual lives and build strong communities by delivering exceptional customer experiences, establishing meaningful partnerships, and creating innovative learning spaces. We seek enthusiastic, openminded, self-motivated individuals who can work well independently and with others. BCPL circulates over 11 million items and provides library services through its 19 branches, 4 mobile library vehicles, and an extensive outreach network. If you are forward thinking and passionate about public service, consider joining BCPL as a part-time <strong>Circulation Assistant II</strong>.</seml>"
			},
			"_endDate": {
				"VALUE": "March, 15 2018 01:00:00"
			},
			"Description": {
				"VALUE": "<seml></seml>"
			},
			"UUID": "d5c3d3a4-f948-4a20-b6dfa26d9c10eb0e",
			"_startDate": {
				"VALUE": "January, 17 2018 01:00:00"
			},
			"_urlTitle": {
				"VALUE": "circulation-assistant-ii"
			},
			"Employment_Type": {
				"VALUE": "Part-Time",
				"LABEL": "Part-Time"
			},
			"Key_Responsibilities": {
				"VALUE": "<seml><ul>\r\n\t<li>Assist customers with check out procedures, permits/licenses, basic catalog searches, and basic computer use</li>\r\n\t<li>Handle customer account concerns including negotiation of fees and collection agency inquiries</li>\r\n\t<li>Use the ILS to register customers for library cards, to check-in materials, to determine specific action for processing items, and to ensure accurate processing of materials</li>\r\n\t<li>Use cash register credit card systems for collecting payments&nbsp;</li>\r\n\t<li>Communicate and enforce rules and policies</li>\r\n\t<li>Respond to materials security system</li>\r\n\t<li>Serve as lead staff at the customer service desk in the absence of a manager</li>\r\n\t<li>Sort and shelve materials and keep them in an orderly fashion</li>\r\n\t<li>Process incoming materials and mail</li>\r\n\t<li>Process Request Manager reports, withdrawn materials, reserves, &amp; problem materials</li>\r\n\t<li>Assist with opening and closing procedures</li>\r\n\t<li>May prepare cash drawers and make bank cash deposits</li>\r\n</ul>\r\n</seml>"
			},
			"Location": {
				"VALUE": "North Point"
			},
			"Salary": {
				"VALUE": "Hourly $11.39 - $15.32, commensurate with experience"
			},
			"To_Apply": {
				"VALUE": "<seml>Send an email to abc@bcpl.net and attach a completed BCPL employment application which you can find on our website www.bcpl.jobs. You must specify the job title Circulation Assistant II: North Point in the subject line of your email.</seml>"
			},
			"Vacancy_ID": {
				"VALUE": "123-123456"
			},
			"ACTIVE": true,
			"_printDate": {
				"VALUE": "January, 26 2018 00:00:00"
			},
			"Requirements": {
				"VALUE": "<seml><ul>\r\n\t<li>High School Graduate or High School equivalency preferred</li>\r\n\t<li>One year of customer service experience working in a public library preferred</li>\r\n\t<li>Ability to sort materials in alpha &amp; numerical order, process basic math transactions, follow instructions, work effectively under minimal supervision, communicate effectively, and exercise sound judgment</li>\r\n\t<li>Basic computer skills demonstrated through use of Microsoft Office applications and email</li>\r\n\t<li>Physical ability to stand at a public service desk for up to 2 hours at a time, lift up to 25 lbs., push/pull carts weighing up to 100 lbs., and read small print</li>\r\n\t<li>Physical ability to bend, kneel, crouch, and stretch for up to 5 minutes at a time</li>\r\n\t<li>Must be able to work a variety of shifts that may include evenings and weekends</li>\r\n\t<li>Must pass a post offer criminal background check High School Graduate or High School equivalency preferred</li>\r\n\t<li>One year of customer service experience working in a public library preferred</li>\r\n\t<li>Ability to sort materials in alpha &amp; numerical order, process basic math transactions, follow instructions, work effectively under minimal supervision, communicate effectively, and exercise sound judgment</li>\r\n\t<li>Basic computer skills demonstrated through use of Microsoft Office applications and email</li>\r\n\t<li>Physical ability to stand at a public service desk for up to 2 hours at a time, lift up to 25 lbs., push/pull carts weighing up to 100 lbs., and read small print</li>\r\n\t<li>Physical ability to bend, kneel, crouch, and stretch for up to 5 minutes at a time</li>\r\n\t<li>Must be able to work a variety of shifts that may include evenings and weekends</li>\r\n\t<li>Must pass a post offer criminal background check</li>\r\n</ul>\r\n</seml>"
			},
			"Internal_Only": {
				"VALUE": false
			}
		}
	],
	"NONFEATUREDITEMS": []
}